<a href="https://colab.research.google.com/github/akheel143/SQL/blob/main/2_SQL_Statments.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**INSERT Data into a Table**

The INSERT statement is used to insert single or multiple records into a table.
Syntax:
INSERT INTO table_name(column_name1, column_name2...column_nameN) 
VALUES(column1_value, column2_value...columnN_value);


```
# INSERT INTO Employee
VALUES(1,'John','King','john.king@abc.com','123.123.1834',33000);
```


```
# INSERT INTO Employee(EmpId, FirstName, LastName)
VALUES(2,'James','Bond');
```

```
# INSERT INTO Employee 
VALUES 
(3,'Neena','Kochhar','neena@test.com','123.456.4568',17000),
(4,'Lex','De Haan','lex@test.com','123.456.4569',15000);
```

**UPDATE Statement**

The UPDATE TABLE statement is used to update records of the table in the database.

Syntax:
UPDATE table_name
SET column_name1 = new_value,
column_name2 = new_value,
...
[WHERE Condition];



```
# UPDATE Employee
SET email = 'jking@test.com'
WHERE EmpId = 1;
```


```
# UPDATE Employee
SET Email = 'jb007@test.com', PhoneNo = '111.111.0007'
WHERE EmpId = 2;
```


```
# UPDATE Employee 
SET Salary = Salary + (Salary * 10/100);
```



```
# Update Values from Another Table Copy
UPDATE Consultant
SET salary = (SELECT salary
FROM Employee WHERE Employee.EmpId = Consultant.EmpId);
```

**DELETE Statement**

Use the DELETE statement to delete records from the existing table in the current schema or tables of the schema on which you have the DELETE privilege.

Syntax:
DELETE FROM table_name [WHERE Condition];

`DELETE FROM Employee WHERE EmpId = 4;`

`DELETE FROM Employee WHERE Salary > 20000;`

`DELETE FROM Employee;`

**TRUNCATE Table Statement**

The TRUNCATE statement is used to delete all rows from a table in the database. It works the same as the DELETE statement, but you cannot use the WHERE clause with the TRUNCATE statement. The deleted rows using the TRUNCATE statement cannot be recovered. It deletes the rows permanently.

Syntax
TRUNCATE TABLE table_name;

`TRUNCATE TABLE Employee;`

**NULL Value**

`SELECT * FROM Employee WHERE PhoneNo IS NULL;`

`SELECT * FROM Employee WHERE Email IS NOT NULL;`

`UPDATE Employee SET Salary = NULL
WHERE EmpId = 1;`